/*

풀기전 생각
방법 1: 아스키 코드 크기를 기준으로 증/감시키기
방법 2: 만약 문자열 바로 변환 함수가 있다면 그거 쓰기...있습니다요...<ctype.h>
+) getchar/putchar을 이용할 수 있을까?

*/

#include <stdio.h>
#include <ctype.h>

int main(void) {

	char str[100];

	printf("문자열을 입력하세요... : ");
	gets_s(str, sizeof(str));

	for (int i = 0; str[i] != '\0'; i++) {
		if (isupper(str[i]) == 1) {//대문자라면...
			str[i] = tolower(str[i]);
		}
		else if (isupper(str[i]) == 0) {
			str[i] = toupper(str[i]);
		}
	}

	printf("변환 결과 : %s", str);

	return 0;
}

/*
첫번째 오류: for문 조건에서 NULL문자를 문자로 두지 않음.(''안붙였다는 뜻)
두번쨰 오류: for문 변수설정할때 자료형 안 붙임 (int)
세번째 오류: scanf는 하나의 단어만 입력 가능, 한 줄 전체 입력받으려면 gets_s()사용해야함.
			gets_s() 사용 방법은 교재 510쪽에 설명되어있으니 참고 하시오...
네번째 오류: toupper()썼다고 끝이 아니라 변수에 저장해줘야만 해!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!으ㅏㅇ아아악!!!!!!!!!!!!!!!!!!!!!!!!!
다섯번째 오류: if if 로 사용하게 되면 개별 조건문이기 때문에 하나에 해당되면 다른 조건 건너뛰기가 안됨...
			 위의 경우에서 else if가 아니라 그냥 if를 사용하게 되면 대문자의 경우,, 대문자 조건에 걸려서 소문자가 되었다가 
			 밑에 소문자 조건에 걸려서 다시 대문자가 되어버림..
*/

//의문점: gets_s사용시에 무조건 배열 크기를 지정해야만 하는지?
//만약 그렇다면 배열 크기가 정해지지 않은채 문자열을 입력할 수 있는 방법이 있는지?